import React from 'react';
import { Vega } from 'react-vega';

const itemSize: number = 30;        // Ширина и высота ячейки(в пикселах)
const cellPadding: number = 0.02;   // Граница между ячейками

const chartData: any = {
    values: [
        {"date": "2019-12-15T00:00:00.000", "value": "0"}, {"date": "2019-12-15T01:00:00.000", "value": "0"},
        {"date": "2019-12-15T02:00:00.000", "value": "0"}, {"date": "2019-12-15T03:00:00.000", "value": "0"},
        {"date": "2019-12-15T04:00:00.000", "value": "0"}, {"date": "2019-12-15T05:00:00.000", "value": "2"},
        {"date": "2019-12-15T06:00:00.000", "value": "0"}, {"date": "2019-12-15T07:00:00.000", "value": "0"},
        {"date": "2019-12-15T08:00:00.000", "value": "0"}, {"date": "2019-12-15T09:00:00.000", "value": "2"},
        {"date": "2019-12-15T10:00:00.000", "value": "0"}, {"date": "2019-12-15T11:00:00.000", "value": "0"},
        {"date": "2019-12-15T12:00:00.000", "value": "2"}, {"date": "2019-12-15T13:00:00.000", "value": "8"},
        {"date": "2019-12-15T14:00:00.000", "value": "8"}, {"date": "2019-12-15T15:00:00.000", "value": "2"},
        {"date": "2019-12-15T16:00:00.000", "value": "2"}, {"date": "2019-12-15T17:00:00.000", "value": "0"},
        {"date": "2019-12-15T18:00:00.000", "value": "0"}, {"date": "2019-12-15T19:00:00.000", "value": "2"},
        {"date": "2019-12-15T20:00:00.000", "value": "4"}, {"date": "2019-12-15T21:00:00.000", "value": "8"},
        {"date": "2019-12-15T22:00:00.000", "value": "8"}, {"date": "2019-12-15T23:00:00.000", "value": "4"},

        {"date": "2019-12-16T00:00:00.000", "value": "0"}, {"date": "2019-12-16T01:00:00.000", "value": "0"},
        {"date": "2019-12-16T02:00:00.000", "value": "0"}, {"date": "2019-12-16T03:00:00.000", "value": "0"},
        {"date": "2019-12-16T04:00:00.000", "value": "0"}, {"date": "2019-12-16T05:00:00.000", "value": "0"},
        {"date": "2019-12-16T06:00:00.000", "value": "0"}, {"date": "2019-12-16T07:00:00.000", "value": "0"},
        {"date": "2019-12-16T08:00:00.000", "value": "0"}, {"date": "2019-12-16T09:00:00.000", "value": "0"},
        {"date": "2019-12-16T10:00:00.000", "value": "2"}, {"date": "2019-12-16T11:00:00.000", "value": "2"},
        {"date": "2019-12-16T12:00:00.000", "value": "0"}, {"date": "2019-12-16T13:00:00.000", "value": "2"},
        {"date": "2019-12-16T14:00:00.000", "value": "2"}, {"date": "2019-12-16T15:00:00.000", "value": "4"},
        {"date": "2019-12-16T16:00:00.000", "value": "0"}, {"date": "2019-12-16T17:00:00.000", "value": "1"},
        {"date": "2019-12-16T18:00:00.000", "value": "2"}, {"date": "2019-12-16T19:00:00.000", "value": "0"},
        {"date": "2019-12-16T20:00:00.000", "value": "0"}, {"date": "2019-12-16T21:00:00.000", "value": "2"},
        {"date": "2019-12-16T22:00:00.000", "value": "0"}, {"date": "2019-12-16T23:00:00.000", "value": "0"},

        {"date": "2019-12-17T00:00:00.000", "value": "0"}, {"date": "2019-12-17T01:00:00.000", "value": "0"},
        {"date": "2019-12-17T02:00:00.000", "value": "0"}, {"date": "2019-12-17T03:00:00.000", "value": "0"},
        {"date": "2019-12-17T04:00:00.000", "value": "0"}, {"date": "2019-12-17T05:00:00.000", "value": "0"},
        {"date": "2019-12-17T06:00:00.000", "value": "4"}, {"date": "2019-12-17T07:00:00.000", "value": "0"},
        {"date": "2019-12-17T08:00:00.000", "value": "4"}, {"date": "2019-12-17T09:00:00.000", "value": "0"},
        {"date": "2019-12-17T10:00:00.000", "value": "0"}, {"date": "2019-12-17T11:00:00.000", "value": "2"},
        {"date": "2019-12-17T12:00:00.000", "value": "2"}, {"date": "2019-12-17T13:00:00.000", "value": "2"},
        {"date": "2019-12-17T14:00:00.000", "value": "4"}, {"date": "2019-12-17T15:00:00.000", "value": "4"},
        {"date": "2019-12-17T16:00:00.000", "value": "8"}, {"date": "2019-12-17T17:00:00.000", "value": "0"},
        {"date": "2019-12-17T18:00:00.000", "value": "0"}, {"date": "2019-12-17T19:00:00.000", "value": "0"},
        {"date": "2019-12-17T20:00:00.000", "value": "7"}, {"date": "2019-12-17T21:00:00.000", "value": "4"},
        {"date": "2019-12-17T22:00:00.000", "value": "0"}, {"date": "2019-12-17T23:00:00.000", "value": "0"},

        {"date": "2019-12-18T00:00:00.000", "value": "0"}, {"date": "2019-12-18T01:00:00.000", "value": "0"},
        {"date": "2019-12-18T02:00:00.000", "value": "0"}, {"date": "2019-12-18T03:00:00.000", "value": "0"},
        {"date": "2019-12-18T04:00:00.000", "value": "0"}, {"date": "2019-12-18T05:00:00.000", "value": "0"},
        {"date": "2019-12-18T06:00:00.000", "value": "2"}, {"date": "2019-12-18T07:00:00.000", "value": "2"},
        {"date": "2019-12-18T08:00:00.000", "value": "0"}, {"date": "2019-12-18T09:00:00.000", "value": "0"},
        {"date": "2019-12-18T10:00:00.000", "value": "0"}, {"date": "2019-12-18T11:00:00.000", "value": "2"},
        {"date": "2019-12-18T12:00:00.000", "value": "0"}, {"date": "2019-12-18T13:00:00.000", "value": "2"},
        {"date": "2019-12-18T14:00:00.000", "value": "0"}, {"date": "2019-12-18T15:00:00.000", "value": "0"},
        {"date": "2019-12-18T16:00:00.000", "value": "8"}, {"date": "2019-12-18T17:00:00.000", "value": "8"},
        {"date": "2019-12-18T18:00:00.000", "value": "0"}, {"date": "2019-12-18T19:00:00.000", "value": "8"},
        {"date": "2019-12-18T20:00:00.000", "value": "0"}, {"date": "2019-12-18T21:00:00.000", "value": "2"},
        {"date": "2019-12-18T22:00:00.000", "value": "2"}, {"date": "2019-12-18T23:00:00.000", "value": "2"},

        {"date": "2019-12-19T00:00:00.000", "value": "0"}, {"date": "2019-12-19T01:00:00.000", "value": "0"},
        {"date": "2019-12-19T02:00:00.000", "value": "0"}, {"date": "2019-12-19T03:00:00.000", "value": "0"},
        {"date": "2019-12-19T04:00:00.000", "value": "0"}, {"date": "2019-12-19T05:00:00.000", "value": "2"},
        {"date": "2019-12-19T06:00:00.000", "value": "2"}, {"date": "2019-12-19T07:00:00.000", "value": "0"},
        {"date": "2019-12-19T08:00:00.000", "value": "0"}, {"date": "2019-12-19T09:00:00.000", "value": "2"},
        {"date": "2019-12-19T10:00:00.000", "value": "0"}, {"date": "2019-12-19T11:00:00.000", "value": "0"},
        {"date": "2019-12-19T12:00:00.000", "value": "2"}, {"date": "2019-12-19T13:00:00.000", "value": "8"},
        {"date": "2019-12-19T14:00:00.000", "value": "8"}, {"date": "2019-12-19T15:00:00.000", "value": "8"},
        {"date": "2019-12-19T16:00:00.000", "value": "2"}, {"date": "2019-12-19T17:00:00.000", "value": "0"},
        {"date": "2019-12-19T18:00:00.000", "value": "0"}, {"date": "2019-12-19T19:00:00.000", "value": "2"},
        {"date": "2019-12-19T20:00:00.000", "value": "4"}, {"date": "2019-12-19T21:00:00.000", "value": "8"},
        {"date": "2019-12-19T22:00:00.000", "value": "8"}, {"date": "2019-12-19T23:00:00.000", "value": "4"},

        {"date": "2019-12-20T00:00:00.000", "value": "0"}, {"date": "2019-12-20T01:00:00.000", "value": "0"},
        {"date": "2019-12-20T02:00:00.000", "value": "0"}, {"date": "2019-12-20T03:00:00.000", "value": "0"},
        {"date": "2019-12-20T04:00:00.000", "value": "0"}, {"date": "2019-12-20T05:00:00.000", "value": "0"},
        {"date": "2019-12-20T06:00:00.000", "value": "0"}, {"date": "2019-12-20T07:00:00.000", "value": "2"},
        {"date": "2019-12-20T08:00:00.000", "value": "8"}, {"date": "2019-12-20T09:00:00.000", "value": "2"},
        {"date": "2019-12-20T10:00:00.000", "value": "2"}, {"date": "2019-12-20T11:00:00.000", "value": "0"},
        {"date": "2019-12-20T12:00:00.000", "value": "2"}, {"date": "2019-12-20T13:00:00.000", "value": "0"},
        {"date": "2019-12-20T14:00:00.000", "value": "2"}, {"date": "2019-12-20T15:00:00.000", "value": "0"},
        {"date": "2019-12-20T16:00:00.000", "value": "0"}, {"date": "2019-12-20T17:00:00.000", "value": "2"},
        {"date": "2019-12-20T18:00:00.000", "value": "8"}, {"date": "2019-12-20T19:00:00.000", "value": "8"},
        {"date": "2019-12-20T20:00:00.000", "value": "0"}, {"date": "2019-12-20T21:00:00.000", "value": "0"},
        {"date": "2019-12-20T22:00:00.000", "value": "2"}, {"date": "2019-12-20T23:00:00.000", "value": "0"},

        {"date": "2019-12-21T00:00:00.000", "value": "0"}, {"date": "2019-12-21T01:00:00.000", "value": "0"},
        {"date": "2019-12-21T02:00:00.000", "value": "0"}, {"date": "2019-12-21T03:00:00.000", "value": "0"},
        {"date": "2019-12-21T04:00:00.000", "value": "0"}, {"date": "2019-12-21T05:00:00.000", "value": "0"},
        {"date": "2019-12-21T06:00:00.000", "value": "0"}, {"date": "2019-12-21T07:00:00.000", "value": "1"},
        {"date": "2019-12-21T08:00:00.000", "value": "2"}, {"date": "2019-12-21T09:00:00.000", "value": "5"},
        {"date": "2019-12-21T10:00:00.000", "value": "0"}, {"date": "2019-12-21T11:00:00.000", "value": "2"},
        {"date": "2019-12-21T12:00:00.000", "value": "0"}, {"date": "2019-12-21T13:00:00.000", "value": "0"},
        {"date": "2019-12-21T14:00:00.000", "value": "4"}, {"date": "2019-12-21T15:00:00.000", "value": "7"},
        {"date": "2019-12-21T16:00:00.000", "value": "5"}, {"date": "2019-12-21T17:00:00.000", "value": "3"},
        {"date": "2019-12-21T18:00:00.000", "value": "7"}, {"date": "2019-12-21T19:00:00.000", "value": "2"},
        {"date": "2019-12-21T20:00:00.000", "value": "0"}, {"date": "2019-12-21T21:00:00.000", "value": "4"},
        {"date": "2019-12-21T22:00:00.000", "value": "1"}, {"date": "2019-12-21T23:00:00.000", "value": "1"},
    ]
};


const spec: any = {
    "width": "1000",
    "padding": 5,

    "data": [
        {
            "name": "lessons_count",
            "values": chartData.values,
            "transform": [
                {"type": "formula", "as": "hour", "expr": "hours(datum.date)"},
                {"type": "formula", "as": "day", "expr": "day(datum.date)"},
                {
                    "type": "aggregate",
                    "groupby": ["day", "hour"],
                    "ops": ["mean"],
                    "fields": ["value"],
                    "as": ["mean_value"]
                }
            ]
        }
    ],
    "signals": [
        {"name": "x_step", "value": itemSize},
        {"name": "width", "update": "bandspace(domain('x').length, 0, 0) * x_step"},
        {"name": "y_step", "value": itemSize},
        {"name": "height", "update": "bandspace(domain('y').length, 0, 0) * y_step"}
    ],
    "marks": [
        {
            "name": "marks",
            "type": "rect",
            "style": ["rect"],
            "from": {"data": "lessons_count"},
            "encode": {
                "update": {
                    "fill": {"scale": "color", "field": "mean_value"},
                    "x": {"scale": "x", "field": "hour"},
                    "width": {"scale": "x", "band": true},
                    "y": {"scale": "y", "field": "day"},
                    "height": {"scale": "y", "band": true},
                }
            }
        }
    ],
    "scales": [
        {
            "name": "x",
            "type": "band",
            "domain": {"data": "lessons_count", "field": "hour", "sort": false},
            "range": {"step": {"signal": "x_step"}},
            "padding": cellPadding
        },
        {
            "name": "y",
            "type": "band",
            "domain": {"data": "lessons_count", "field": "day", "sort": true},
            "range": {"step": {"signal": "y_step"}},
            "padding": cellPadding
        },
        {
            "name": "color",
            "type": "linear",
            "range": {"scheme": "tealblues"},
            "domain": {"data": "lessons_count", "field": "mean_value"},
            "interpolate": "hcl",
            "zero": false,
        }
    ],
    "axes": [
        {
            "scale": "x",
            "orient": "bottom",
            "labelAlign": "center",
            "labelOverlap": true,
            "zindex": 1,
            "tickCount": 8,
            "tickOpacity": 0,
            "encode": {
                "labels": {
                    "update": {
                       "text":  {"signal": "datum.value === 0 ? '12am' : datum.value === 12 ? '12pm' : datum.value < 12 ? datum.value + 'am' : (datum.value - 12) + 'pm'"}
                    }
                }
            }
        },
        {
            "scale": "y",
            "orient": "left",
            "labelPadding": 10,
            "tickOpacity": 0,
            "zindex": 1,
            "encode": {
                "labels": {
                    "update": {
                        "text":  {"signal": "dayFormat(datum.value)"}
                    }
                }
            }

        }
    ],
    "legends": [
        {
            "fill": "color",
            "direction": "horizontal",
            "orient": "bottom",
            "gradientLength": {"signal": "clamp(height, 64, 200)"},
            "symbolType": "square",
        }
    ]}


export default function HeatMap() {
    return (
        <Vega spec={spec} />
    );
}